Repository: armcc/resolvconf
Catalog: debian/po/*.po
Languages: de, es, fr, gl, ja, nl, sv, vi

source: This package contains the infrastructure required for dynamic updating of the resolver configuration file. Part of the necessary infrastructure is a symbolic link from /etc/resolv.conf to /etc/resolvconf/run/resolv.conf. If you agree then this link will be created. The existing /etc/resolv.conf file will be preserved as /etc/resolvconf/resolv.conf.d/original; it will be restored if this package is removed.
de: Dieses Paket enthält die für das dynamische Aktualisieren der resolver-Konfigurationsdatei benötigte Infrastruktur. Teil der notwendigen Infrastruktur ist ein symbolischer Link von /etc/resolv.conf auf /etc/resolvconf/run/resolv.conf. Falls Sie dem zustimmen wird dieser Link angelegt. Die bestehende /etc/resolv.conf-Datei wird als /etc/resolvconf/resolv.conf.d/original erhalten; sie wird wiederhergestellt, falls diese Paket entfernt wird.
es: Este paquete incluye la infraestructura necesaria para poder actualizar de forma automática el fichero de configuración de resolución. Un enlace simbólico de «/etc/resolv.conf» a «/etc/resolvconf/run/resolv.conf» es parte de la infraestructura necesaria. Se preservarán los contenidos del fichero «/etc/resolv.conf» actual en el fichero «/etc/resolvconf/resolv.conf.d/original». Se restaurará este archivo si elimina el paquete.
fr: Ce paquet installe l'infrastructure permettant la mise à jour du fichier de configuration du résolveur. Une des modifications nécessaires est la mise en place d'un lien symbolique depuis /etc/resolv.conf vers /etc/resolvconf/run/resolv.conf. Si vous acceptez, alors ce lien sera créé. Le fichier /etc/resolv.conf sera conservé sous le nom de /etc/resolvconf/resolv.conf.d/original. Si ce paquet est enlevé, le fichier sera remis dans son état original.
gl: Este paquete contén a infraestrutura necesaria para actualizar dinamicamente o ficheiro de configuración do resolvedor. Parte dela é unha ligazón simbólica de /etc/resolv.conf a /etc/resolvconf/run/resolv.conf. Se acepta isto, hase crear esa ligazón. O ficheiro /etc/resolv.conf existente hase conservar coma /etc/resolvconf/resolv.conf.d/original; hase restaurar se se elimina este paquete.
nl: Dit pakket bevat de infrastructuur om automatisch bijwerken van het resolver-configuratiebestand mogelijk te maken. Een gedeelte van de noodzakelijke infrastructuur is een symbolische koppeling van /etc/resolv.conf naar /etc/resolvconf/run/resolv.conf. Als u toestemt zal deze koppeling gemaakt worden. Het bestaande /etc/resolv.conf bestand zal worden bewaard als /etc/resolvconf/resolv.conf.d/original; het zal worden teruggeplaatst als het pakket wordt verwijderd.
sv: Detta paket innehåller infrastrukturen som krävs för dynamiska uppdateringar av filen för uppslagskonfigurationen. En del av den nödvändiga infrastrukturen är en symbolisk länk från /etc/resolv.conf till /etc/resolvconf/run/resolv.conf. Om du godkänner kommer denna länk att skapas. Den existerande filen /etc/resolv.conf kommer att behållas som /etc/resolvconf/resolv.conf.d/original; den kommer att återställas om detta paket tas bort.
vi: Gói tin này chứa hạ tầng cơ sở cần thiết để cập nhật động tập tin cấu hình tháo gỡ. Phần của hạ tầng cơ sở cần thiết là một liên kết tượng trưng từ «/etc/resolv.conf» đến «/etc/resolvconf/run/resolv.conf». Nếu bạn chấp nhận thì sẽ tạo liên kết này. Tập tin «/etc/resolv.conf» tồn tại sẽ được bảo quản là «/etc/resolvconf/resolv.conf.d/original» và sẽ được phục hồi nếu gói tin này bị loại bỏ.

source: If you wish to prevent future installations from recreating the symbolic link then you can run dpkg-reconfigure later to withdraw your agreement.
de: Falls Sie zukünftige Installationen am Erzeugen der symbolischen Links hindern wollen können Sie später dpkg-reconfigure aufrufen um Ihre Zustimmung zurückzuziehen.
es: Puede ejecutar «dpkg-reconfigure» más adelante para cancelar su consentimiento si desea que las instalaciones futuras no recreen el enlace simbólico.
fr: Si vous souhaitez empêcher les prochaines installations de recréer le lien symbolique, vous pouvez utiliser dpkg-reconfigure plus tard pour retirer votre accord.
gl: Se quere evitar que as instalacións futuras volvan crear a ligazón simbólica, pode executar dpkg-reconfigure máis tarde para eliminar a súa aceptación.
ja: 今後のインストールの際には、シンボリックリンクの再生成をしたくなくなった場合、dpkg-reconfigure を後ほど実行すれば決定を取り消せます。
nl: Als u wilt voorkomen dat tijdens een toekomstige installatie de symbolische koppeling wordt gemaakt, kunt u dpkg-reconfigure uitvoeren en uw toestemming intrekken.
sv: Om du önskar att förhindra framtida installationer från att återskapa symboliska länkar kan du köra dpkg-reconfigure senare för att ändra dina inställningar.
vi: Nếu bạn muốn ngăn cản việc cài đặt sau nào tạo lại liên kết tượng trưng ấy thì có thể chạy lệnh «dpkg-reconfigure» sau này để rút sự chấp nhận này.

source: If you do not agree then the necessary symbolic link will not be created and consequently your resolver configuration file will not be dynamically updated. In order to activate dynamic updating you will have to configure resolvconf manually following the straightforward instructions in the README file. If you choose not to configure resolvconf at all then you should remove the package because its presence causes some programs to deviate from their default behavior.
de: Falls Sie nicht zustimmen wird der symbolische Link nicht erzeugt und konsequenterweise wird Ihre Resolver-Konfiguration nicht dynamisch aktualisiert. Um die dynamische Aktualisierung zu aktivieren müssen Sie resolvconf manuell konfigurieren. Folgen Sie hierzu den gradlinigen Anweisungen in der README-Datei. Falls Sie resolvconf überhaupt nicht konfigurieren wollen sollten Sie das Paket entfernen da seine Anwesenheit dazu führt, daß einige Programme von ihrem Standardverhalten abweichen.
es: El enlace simbólico necesario no se creará y, por tanto, su fichero de configuración de resolución no podrá actualizarse de forma automática si no da su consentimiento. Para poder activar las actualizaciones dinámicas deberá configurar de forma manual a resolvconf siguiendo las indicaciones en el fichero README. Si desea no configurar resolvconf, todo lo que tiene que hacer es eliminar el paquete porque si está instalado algunos programas tendrán un comportamiento distinto del habitual.
fr: Si vous n'acceptez pas, alors votre fichier de configuration du résolveur ne sera pas mis à jour dynamiquement. Vous devrez configurer le paquet vous-même selon les instructions contenues dans le fichier README. Si vous ne voulez pas configurer resolvconf vous-même alors vous devriez enlever le paquet resolvconf car la présence du paquet altère le comportement par défaut de plusieurs programmes.
gl: Se non o acepta, non se ha crear a ligazón simbólica necesaria e, polo tanto, non se ha actualizar dinamicamente o ficheiro de configuración do resolvedor. Para activar as actualizacións dinámicas ha ter que configurar resolvconf manualmente seguindo as instruccións do ficheiro README. Se decide non configurar resolvconf en absoluto debería eliminar o paquete porque a súa presencia fai que algúns programas cambien de comportamento.
ja: ここで「いいえ」と答えると、必要なシンボリックリンクは作成されず、従ってリゾルバ設定ファイルは動的には更新されません。動的更新を有効にするには、README ファイルの指示に従って resolvconf を手動で設定する必要があります。resolvconf を全く設定しないのを選んだ場合は、このパッケージが存在するが故にいくつかのプログラムが通常とは違った挙動をするようになるため、パッケージを削除する必要があります。
nl: Als u niet toestemt, zal de noodzakelijke symbolische koppeling niet worden gemaakt; uw resolver-configuratiebestand zal dus niet automatisch worden bijgewerkt. Om automatisch bijwerken in te schakelen dient u resolvconf aan de hand van de aanwijzingen in het README-bestand handmatig in te stellen. Als u ervoor kiest om resolvconf helemaal niet in te stellen dient u het pakket te verwijderen; de aanwezigheid zorgt er namelijk voor dat sommige programma's afwijken van hun standaardgedrag.
sv: Om du inte godkänner kommer den nödvändiga symboliska länken inte att skapas och därför kommer din konfigurationsfil för uppslag inte att bli dynamiskt uppdaterad. För att aktivera dynamiska uppdateringar behöver du konfigurera resolvconf manuellt genom att följa instruktionerna i filen README. Om du väljer att inte konfigurera resolvconf alls bör du ta bort paketet därför att det kan orsaka störningar för vissa program.
vi: Nếu bạn không chấp nhận thì trình này sẽ không tạo liên kết tượng trưng cần thiết, vì vậy tập tin cấu hình tháo gỡ của bạn sẽ không được cập nhật động. Để hoạt hóa khả năng cập nhật động, bạn sẽ cần phải tự cấu hình trình resolvconf, theo những hướng dẫn thẳng thắn trong tập tin «README» (Đọc đi). Nếu bạn chọn không cấu hình trình resolvconf bằng cách nào cả, thì bạn nên loại bỏ gói tin này vì sự hiện diện của nó gây ra một số chương trình xử sự bất thường.

source: However you decide, you should read the README file.
de: Wie auch immer Sie sich entscheiden sollten sie die README-Datei lesen.
es: Debería leer el fichero README decida lo que decida.
fr: En tout cas il est conseillé de lire le fichier README.
gl: Decida o que decida, debería consultar o ficheiro README.
ja: いずれにせよ、README ファイルを読むべきです。
nl: Wat u ook beslist, het wordt aanbevolen om het README-bestand te lezen.
sv: Hur du än väljer bör du läsa filen README.
vi: Trong bất cứ trường hợp nào, bạn nên đọc tập tin «README» (Đọc đi).

source: Remember to reconfigure network interfaces
de: Denken Sie daran, die Netzwerk-Schnittstelle zu rekonfigurieren
es: Recuerde que debe reconfigurar sus interfaces de red
fr: N'oubliez pas de reconfigurer les interfaces
gl: Lembre configurar as interfaces de rede
ja: ネットワークインターフェイスの再設定を忘れないで下さい
nl: Vergeet niet netwerk-interfaces opnieuw in te stellen
sv: Kom i håg att konfigurera om nätverksgränssnitten
vi: Nhớ để cấu hình lại các giao diện mạng.

source: Once resolvconf is installed, interface configurers supply nameserver information to it (which it then makes available to the C Library resolver and to DNS caches). However, they do this only when they bring up interfaces. Therefore for resolvconf's nameserver information to be up to date after initial installation it is necessary to reconfigure interfaces -- that is, to take them down and then to bring them up again -- and to restart DNS caches.
de: Sobald resolvconf installiert ist, versorgen die Schnittstellenkonfigurier es mit Nameserverinformationen (welche es dann dem C-Bibliothek-Resolver und dem DNS-Cache zugängig macht). Allerdings gschieht dies nur, wenn die Schnittstelle hochgefahren wird. Deshalb müssen die Schnittstellen nach derErstinstallation rekonfiguriert werden, damit die Nameserver-Informationen von resolvconf aktuell sind, d.h. die Schnittstellen müßen runter- und dann wieder hochgefahren werden -- und DNS-Caches müssen neugestartet werden.
es: Los configuradores de los interfaces proveen la información de los servidores de nombres disponibles una vez haya instalado resolvconf. Esta información se proporciona, a su vez, para la resolución a través de la biblioteca C y para las cachés de DNS. Sin embargo, este cambio sólo se produce cuando se activa un interfaz. Es necesario, por tanto, para que la información de los servidores de nombres que resolvconf tiene esté actualizada, que se reconfiguren los interfaces (es decir, que se desactiven y se vuelvan a activar) y que se reinicien las cachés de DNS.
fr: Une fois que resolvconf est installé, les configurateurs d'interfaces lui fournissent l'information du serveur de noms (qu'il rend alors disponible au résolveur de la bibliothèque C et aux caches DNS). Cependant, cela ne se produit qu'au démarrage des interfaces. Par conséquent, pour que l'information du serveur de noms de resolvconf soit mise à jour après l'installation du paquet, il est nécessaire de redémarrer les interfaces. Arrêtez-les, puis redémarrez-les et réinitialisez les caches DNS.
gl: Despois de instalar resolvconf, os configuradores de interfaces hanlle fornecer información sobre os servidores de nomes (que despois fai dispoñible ao resolvedor da biblioteca de C e ás cachés de DNS). Nembargantes, só o fan ao activar interfaces. Polo tanto, para que a información sobre servidores de nomes de resolvconf estea actualizada trala instalación inicial é necesario reconfigurar as interfaces -- é dicir, baixalas e volvelas erguer -- e reiniciar as cachés de DNS.
ja: 一旦 resolvconf がインストールされると、インターフェイス設定でネームサーバ情報を提供します (C ライブラリのリゾルバと DNS キャッシュで利用可能になります)。しかし、これはインターフェイスが起動された時のみです。そのため、resolvconf のネームサーバ情報を初期インストール後に更新するには、インターフェイスの再設定−つまり、インターフェイスを一旦ダウンし、その後再度アップする−とDNS キャッシュの再起動が必要になります。
nl: Nadat resolvconf is geïnstalleerd zullen programma's die een netwerk-interface configureren informatie omtrent naamservers aan resolvconf doorgeven. (Op zijn beurt zal resolvconf deze informatie beschikbaar maken aan de C-bibliotheekresolver en aan DNS-caches.) Dit gebeurt echter alleen als een interface op wordt gebracht. Om na de installatie resolvconf van actuele informatie te voorzien, dienen de netwerk-interfaces opnieuw te worden ingesteld -- dat betekent neerbrengen met het ifdown-commando en weer op met het ifup-commando -- en de DNS-caches te worden herstart.
sv: När resolvconf är installerat kommer gränssnittskonfiguratörer att bistå med namnserverinformation till det (som den för tillgänglig till C-biblioteket resolver och till DNS-cache). Dock görs detta endast när de tar upp gränssnitten. Därför att resolvconfs namnserverinformation ska vara uppdaterad efter initial installation är det nödvändigt att återkonfigurera gränssnitten - alltså, ta ner dem och sedan ta upp dem -- och att starta om DNS-cache.
vi: Một khi đã cài đặt trình resolvconf, bộ cấu hình giao diện sẽ cung cấp cho nó thông tin về máy phục vụ tên (mà nó lần lượt cung cấp cho trình tháo gỡ thư viên C và bộ nhớ tạm DNS). Tuy nhiên, bộ ấy làm như thế chỉ khi bật giao diện. Vì vậy để cập nhật thông tin về máy phục vụ tên của trình resolvconf sau khi cài đặt ban đầu, cần phải cấu hình lại giao diện — tức là, tắt rồi bật mỗi điều — và khởi chạy lại các bộ nhớ tạm DNS.

source: Append original file to dynamic file?
de: Die ursprüngliche Datei an die dynamische Datei anhängen?
es: ¿Añadir el fichero original al final del fichero dinámico?
fr: Ajouter le fichier original au fichier dynamique ?
gl: ¿Engadir o ficheiro orixinal ao ficheiro dinámico?
ja: 更新されるファイルにオリジナルのファイルを追加しますか?
nl: Originele bestand aan het eind van dynamische bestand toevoegen?
sv: Lägg till originalfil till dynamisk fil?
vi: Phụ thêm tập tin gốc vào tập tin động không?

source: If your original static resolver configuration file (/etc/resolv.conf) contains nameserver addresses then those addresses should be listed on "dns-nameservers" lines in /etc/network/interfaces as described in the README. Until you have modified /etc/network/interfaces and reconfigured the affected interfaces resolvconf will not include those addresses in the dynamically generated resolver configuration file. Without those addresses you may have trouble resolving domain names. A TEMPORARY solution is to append the whole original resolver configuration file to the end of the dynamically generated file. This will be done if there is a symbolic link from /etc/resolvconf/resolv.conf.d/tail to /etc/resolvconf/resolv.conf.d/original. If you agree then this symbolic link will be created, provided that no /etc/resolvconf/resolv.conf.d/tail already exists.
de: Falls Ihre ursprüngliche statische Resolver-Konfigurationsdatei (/etc/resolv.conf) Nameserver-Adressen enthielt sollten diese wie in der README-Datei beschrieben in den "dns-nameservers"-Zeilen in /etc/network/interfaces aufgeführt werden. Bis Sie /etc/network/interfaces geändert und die betroffene Schnittstelle rekonfiguriert haben wird resolvconf diese nicht in der dynamisch generierten Resolver-Konfigurationsdatei aufführen. Ohne diese Adressen könnte es zu Problemen bei der Namensauflösung kommen. Eine VORÜBERGEHENDE Lösung ist es, die gesamte ursprüngliche Resolverkonfigurationsdatei an das Ende der dynamisch generierten Datei anzuhängen. Dies wird geschehen, falls es einen symbolischen Link von /etc/resolvconf/resolv.conf.d/tail nach /etc/resolvconf/resolv.conf.d/original gibt. Falls Sie zustimmen, wird der symbolische Link erzeugt, vorausgesetzt, /etc/resolvconf/resolv.conf.d/tail existiert noch nicht.
es: Si su fichero de configuración de resolución original («/etc/resolv.conf») contiene direcciones de servidores de nombres, deberá incluir estas direcciones en las líneas «dns-nameservers» en el fichero «/etc/network/interfaces» tal y como se describe en el README. No se incluirían estas direcciones en el fichero de configuración de resolución generado dinámicamente hasta que no haya modificado el fichero «/etc/network/interfaces» y haya reconfigurado los interfaces que pudieran estar afectados. Sin estas direcciones tendrá problemas para poder resolver nombres de dominio. Una solución TEMPORAL consiste en incorporar al final del fichero generado de forma dinámica toda la información de resolución original. Esto se hace si de forma automática si se crea un enlace simbólico de «/etc/resolvconf/resolv.conf.d/tail» a «/etc/resolvconf/resolv.conf.d/original». Este enlace simbólico se creará si usted lo autoriza, siempre y cuando no exista ya un fichero «/etc/resolvconf/resolv.conf.d/tail».
fr: Si votre fichier statique original de configuration du résolveur (/etc/resolv.conf) contient des adresses de serveur de noms, ces adresses devraient être mentionnées dans les lignes « dns-nameservers » du fichier /etc/network/interfaces comme décrit dans le fichier README. Tant que vous n'aurez pas modifié le fichier /etc/network/interfaces, resolvconf n'inclura pas ces adresses dans le fichier dynamiquement produit de configuration du résolveur. Sans ces adresses, vous aurez peut-être des difficultés avec les noms de domaines. Une solution PROVISOIRE est l'ajout du contenu du fichier statique original du résolveur à la fin du fichier généré dynamiquement. Ceci sera fait si il y a un lien symbolique de /etc/resolvconf/resolv.conf.d/tail vers /etc/resolvconf/resolv.conf.d/original. Si vous êtes d'accord, ce lien symbolique sera créé, à condition qu'aucun lien symbolique /etc/resolvconf/resolv.conf.d/tail n'existe déjà.
gl: Se o seu ficheiro estático orixinal de configuración do resolvedor (/etc/resolv.conf) contén enderezos de servidores de nomes, eses enderezos deberían aparecer en liñas "dns-nameservers" de /etc/network/interfaces tal como se describe no ficheiro README. Ata que teña modificado /etc/network/interfaces e reconfiguradas as interfaces afectadas, resolvconf non ha incluír eses enderezos no ficheiro de configuración do resolvedor xerado dinamicamente. Sen eses enderezos pode ter problemas para resolver nomes de dominio. Unha solución TEMPORAL é engadir o ficheiro de configuración orixinal ao final do ficheiro xerado dinamicamente. Isto hase facer se existe unha ligazón simbólica de /etc/resolvconf/resolv.conf.d/tail a /etc/resolvconf/resolv.conf.d/original. Se acepta isto, hase crear esta ligazón simbólica, sempre e cando non exista xa /etc/resolvconf/resolv.conf.d/tail.
ja: 元々の静的なリゾルバ設定ファイル (/etc/resolv.conf) がネームサーバのアドレスを含んでいた場合、README に書いてあるように、そのアドレスは /etc/network/interfaces の "dns-nameservers" 行に記述すべきです。/etc/network/interfaces を編集して影響を受けるインターフェイスを再設定するまで、resolvconf は動的に生成するリゾルバ設定ファイルにこのアドレスを含めません。このアドレスがないとドメイン名の解決に苦労するでしょう。「一時的な」解決方法は、元々の静的なリゾルバ設定ファイルを動的に生成したファイルの最後に丸ごと含めることです。 /etc/resolvconf/resolv.conf.d/tail から /etc/resolvconf/resolv.conf.d/original へのシンボリックリンクが存在していた場合、これが実行されます。ここで「はい」と答えると、/etc/resolvconf/resolv.conf.d/tail がまだ存在していなければ、このシンボリックリンクが作成されるでしょう。
nl: Als uw originele statische resolver-configuratiebestand (/etc/resolv.conf) naamserver-adressen bevatte, dan dienen die adressen te worden genoemd op "dns-nameservers"-regels in /etc/network/interfaces, zoals wordt beschreven in de README. Tot op het moment waarop /etc/network/interfaces is aangepast en u de betreffende netwerk-interfaces opnieuw heeft ingesteld, zal resolvconf deze adressen niet in het automatisch gegenereerde resolver-configuratiebestand opnemen. Zonder deze adressen kunt u problemen krijgen met het opzoeken van domeinnamen. Een TIJDELIJKE oplossing is het originele bestand in zijn geheel toevoegen aan het eind van het dynamisch gegenereerde bestand. Dit zal worden gedaan als er een symbolische koppeling is van /etc/resolvconf/resolv.conf.d/tail naar /etc/resolvconf/resolv.conf.d/original. Als u toestemt dan zal deze symbolische koppeling worden gemaakt, op voorwaarde dat /etc/resolvconf/resolv.conf.d/tail nog niet bestaat.
sv: Om din ursprungliga konfigurationsfil för uppslag (/etc/resolv.conf) innehåller namnserverinformation ska dessa adresser listas på raderna som innehåller "dns-nameservers" i /etc/network/interfaces som beskrivits i README-filen. Tills du har modifierat /etc/network/interfaces och återkonfigurerat de berörda gränssnitten kommer resolvconf inte att inkludera de adresserna i den dynamiskt genererade konfigurationsfilen för uppslag. Utan dessa adresser kan du få problem att slå upp domännamn. En TEMPORÄR lösning är att lägga till hela den ursprungliga konfigurationsfilen på slutet av den dynamiskt genererade filen. Detta kan göras om det finns en symbolisk länk från /etc/resolvconf/resolv.conf.d/tail till /etc/resolvconf/resolv.conf.d/original. Om du godkänner kommer denna symboliska länk att skapas om ingen /etc/resolvconf/resolv.conf.d/tail redan existerar.
vi: Nếu tập tin cấu hình tháo gỡ tĩnh của bạn («/etc/resolv.conf») có chứa địa chỉ máy phục vụ tên nào, thì các địa chỉ này nên được liệt kê trên dòng «dns-nameservers» (máy phục vụ tên DNS) trong «/etc/network/interfaces», như được diễn tả trong tập tin «README» (Đọc đi). Cho đến khi bạn đã sửa đổi «/etc/network/interfaces» và cấu hình lại các giao diện liên quan, trình resolvconf sẽ không bao gồm những địa chỉ này trong tập tin cấu hình tháo gỡ được tạo ra một cách động. Nếu không có những địa chỉ này, bạn có thể gặp khó khăn tháo gỡ tên miền. Một cách giải quyết TẠM THỜI là phụ thêm tập tin cấu hình tháo gỡ gốc vào kết thức của tập tin được tạo ra một cách động. Sẽ làm như thế nếu có một liên kết tượng trưng từ «/etc/resolvconf/resolv.conf.d/tail» đến «/etc/resolvconf/resolv.conf.d/original». Nếu bạn chấp nhận thì liên kết tượng trưng này sẽ được tạo, nếu chưa có «/etc/resolvconf/resolv.conf.d/tail».
