Repository: armcc/resolvconf
Catalog: debian/po/*.po
Languages: de, es, fr, gl, ja, nl, sv, vi

source: A rogue pppconfig PPP hook script is present
de: Ein vandalierendes pppconfig-PPP-Einhäng-Skript ist vorhanden
es: Se ha encontrado un programa «anzuelo» PPP de pppconfig
fr: Script de configuration PPP de pppconfig erroné
ja: 問題になりそうな pppconfig の PPP フックスクリプトが存在しています。
nl: Een schadelijk PPP-haak-script van pppconfig is aanwezig.
sv: Ett påverkande PPP-kopplingsskript för pppconfig hittades

source: Certain versions of the pppconfig package contain scripts /etc/ppp/ip-up.d/0dns-up and /etc/ppp/ip-down.d/0dns-down (run by pppd after a PPP interface is brought up or down) that overwrite /etc/resolv.conf. These scripts must be modified, disabled or deleted so that they will not interfere with the operation of resolvconf.
de: Bestimmte Versionen des pppconfig-Paketes enthalten die Skripte /etc/ppp/ip-up.d/0dns-up und /etc/ppp/ip-down.d/0dns-down (welche vom pppd ausgeführt werden, nachdem die PPP-Schnittstelle hoch oder runtergefahren wurde) die /etc/resolv.conf überschreiben. Diese Skripte müssen modifiziert, deaktiviert oder gelöscht werden, so daß sie nicht mit der Arbeit von resolvconf interferieren.
es: Algunas versiones del paquete pppconfig incluyen los programas «/etc/ppp/ip-up.d/0dns-up» y «/etc/ppp/ip-down.d/0dns-down» (para que los ejecute pppd después de que una interfaz PPP se haya activado o desactivado) que sobreescriben el fichero «/etc/resolv.conf». Estos programas deben modificarse, deshabilitarse o borrarse para que no interfieran con el mecanismo de operación de resolvconf.
fr: Certaines versions du paquet pppconfig contiennent deux scripts /etc/ppp/ip-up.d/0dns-up et /etc/ppp/ip-down.d/0dns-down (lancés par pppd dès qu'une interface PPP est démarrée) qui réécrivent le fichier /etc/resolv.conf. Ces scripts doivent donc être modifiés, neutralisés ou enlevés afin qu'il n'y ait aucune interférence avec l'intervention de resolvconf.
ja: ある特定バージョンの pppconfig パッケージは、/etc/resolv.conf を上書きする /etc/ppp/ip-up.d/0dns-up および /etc/ppp/ip-down.d/0dns-down スクリプトを含んでいます。(これらは pppd によって PPP インターフェイスが開始または停止する際に実行されます)。resolvconf の動作に干渉しないように、これらのスクリプトは修正・無効化、あるいは削除を行う必要があります。
nl: Bepaalde versies van het pakket pppconfig bevatten scripts /etc/ppp/ip-up.d/0dns-up en /etc/ppp/ip-down.d/0dns-down (die worden uitgevoerd door pppd nadat een PPP-interface op of neer is gebracht) die /etc/resolv.conf overschrijven. Deze scripts moeten dus worden aangepast, uitgezet of verwijderd, zodat ze de werking van resolvconf niet verstoren.
sv: Vissa versioner av paketet pppconfig innehåller skripten /etc/ppp/ip-up.d/0dns-up och /etc/ppp/ip-down.d/0dns-down (körs av pppd efter ett PPP-gränssnitt tas upp eller ner) som skriver över /etc/resolv.conf. Dessa skript måste modifieras, stängas av eller tas bort så att de inte påverkar resolvconf.

source: A non-empty executable script /etc/ppp/ip-up.d/0dns-up and/or /etc/ppp/ip-down.d/0dns-down has been detected that appears to overwrite /etc/resolv.conf. Each one that does so must be modified, disabled or deleted. The best way to disable it is to remove its execute permission. The best way to delete it is to purge the pppconfig package.
de: Ein nicht-leeres, ausführbares Skript /etc/ppp/ip-up.d/0dns-up und/oder /etc/ppp/ip-down.d/0dns-down wurde erkannt, das /etc/resolv.conf zu überschreiben scheint. Jedes das dies macht, muß modifiziert, deaktiviert oder gelöscht werden. Der beste Weg es zu deaktivieren, ist es, das Ausführrecht zu entfernen. Der beste Weg es zu löschen, ist es, das pppconfig-Paket komplett zu löschen.
es: Se ha detectado un programa ejecutable y no vacío «/etc/ppp/ip-up.d/0dns-up» y/o «/etc/ppp/ip-down.d/0dns-down» que parece que sobreescribe/n «/etc/resolv.conf». Debe modificarse, deshabilitarse o borrarse cada programa que hace esto. La mejor forma de deshabilitarlos es quitar los permisos de ejecución al programa. La mejor forma de borrarlos es purgar el paquete pppconfig.
fr: Un script exécutable /etc/ppp/ip-up.d/0dns-up ou /etc/ppp/ip-down.d/0dns-down a été détecté qui semble réécrire le fichier /etc/resolv.conf. Chaque script qui fait cela doit être modifié, désactivé ou enlevé. La meilleure façon de le désactiver est d'enlever sa permission d'exécution. La meilleure façon de le effacer est de purger le paquet pppconfig.
ja: /etc/resolv.conf を上書きするであろう、空でない実行可能なスクリプト /etc/ppp/ip-up.d/0dns-up および /etc/ppp/ip-down.d/0dns-down が検出されました。それぞれ、修正する・無効にする、あるいは削除を行う必要があります。無効にするのに最も良い方法は、実行権限を削除すること。そして、削除するのに最も良い方法は、pppconfig パッケージを完全に削除 (purge) することです。
nl: Er is een niet-leeg, uitvoerbaar script /etc/ppp/ip-up.d/0dns-up en/of /etc/ppp/ip-down.d/0dns-down aangetroffen die schijnt /etc/resolv.conf over te schrijven. Elk script die dat werkelijk doet dient te worden aangepast, uitgezet of verwijderd. De beste manier om het script uit te zetten is door zijn uitvoer-permissie te verwijderen. De beste manier om het script te verwijderen is het pppconfig pakket te wissen (purge).
sv: Ett icke-blankt startbart skript, /etc/ppp/ip-up.d/0dns-up och/eller /etc/ppp/ip-down.d/0dns-down har identifierats och som verkar skriva över /etc/resolv.conf. De måste modifieras, stängas av eller tas bort. Det bästa sättet att stänga av de är att ta bort dess rättighet att starta. Det bästa sättet att ta bort det är att rensa ut paketet pppconfig.

source: A rogue pppoeconf PPP hook script is present
de: Ein vandalierendes pppoeconf-PPP-Einhäng-Skript ist vorhanden
es: Se ha encontrado un programa «anzuelo» PPP de pppoeconf
fr: Script de configuration PPP de pppoeconf erroné
ja: 問題になりそうな pppoeconf の PPP フックスクリプトが存在しています
nl: Een schadelijk PPP-haak-script van pppoeconf is aanwezig.
sv: Ett påverkande PPP-kopplingsskript för pppoeconf hittades

source: Versions of the pppoeconf package prior to version 1.0 contain a script /etc/ppp/ip-up.d/000usepeerdns (run by pppd after a PPP interface is brought up) that overwrites /etc/resolv.conf. The script must be modified, disabled or deleted so that it will not interfere with the operation of resolvconf. Contrary to Debian policy, merely removing the pppoeconf package does not disable the script.
de: Versionen des pppoeconf-Paketes vor Version 1.0 enthalten ein Skript /etc/ppp/ip-up.d/000usepeerdns (welches vom pppd ausgeführt wird, nachdem die PPP-Schnittstelle hochgefahren wurde) das /etc/resolv.conf überschreibt. Das Skript muß modifiziert, deaktiviert oder gelöscht werden, so das es nicht mit der Arbeit von resolvconf interferiert. Entgegen den Debian-Richtlinien reicht das Entfernen des Pakets nicht aus, um das Skript zu deaktivieren.
es: Las versiones del paquete pppoeconf anteriores a la versión 1.0 incluían un programas «/etc/ppp/ip-up.d/000usepeerdns» (ejecutado por pppd después de que una interfaz PPP se activara) que sobreescribe el fichero «/etc/resolv.conf». Este programa debe modificarse, deshabilitarse o borrarse para que no interfiera con el mecanismo de operación de resolvconf. Aunque es lo opuesto a lo que manda la normativa de Debian, no basta con borrar simplemente el paquete pppoeconf para deshabilitar el programa.
fr: Le paquet pppoeconf antérieur à la version 1,0 contient un script /etc/ppp/ip-up.d/000usepeerdns (lancé par pppd dès qu'une interface PPP est démarrée) qui réécrit le fichier /etc/resolv.conf. Le script doit donc être modifié, neutralisé ou enlevé afin qu'il n'y ait aucune interférence avec l'intervention de resolvconf. Contrairement à la charte Debian, une simple suppression du paquet pppoeconf ne neutralise pas le script.
ja: バージョン 1.0 以前の pppoeconf パッケージは /etc/resolv.conf を上書きする /etc/ppp/ip-up.d/000usepeerdns スクリプトを含んでいます (これは、pppd によって PPP インターフェイスが起動した後に実行されます)。resolvconf の動作に干渉しないように、これらのスクリプトは修正・無効化、あるいは削除を行う必要があります。Debian ポリシーに反して、単純に pppoeconf パッケージの削除ではスクリプトは無効にされません。
nl: Versies van het pakket pppoeconf vroeger dan 1.0 bevatten het script /etc/ppp/ip-up.d/000usepeerdns (dat wordt uitgevoerd door pppd nadat een PPP-interface op is gebracht) dat /etc/resolv.conf overschrijft. Dit script moet dus worden aangepast, uitgezet of verwijderd, zodat het de werking van resolvconf niet verstoort. Ondanks dat Debian-beleid dit eist, zal het verwijderen (remove) van het pakket pppoeconf dit script niet uitzetten.
sv: Versioner av paketet pppoeconf före version 1.0 innehåller ett skript, /etc/ppp/ip-up.d/000usepeerdns (körs av pppd efter ett PPP-gränssnitt satts upp) som skriver över /etc/resolv.conf. Skriptet måste modifieras, stängas av eller tas bort så att det inte påverkar resolvconf. Tvärtemot Debians policy räcker det inte att ta bort paketet pppoeconf för att stänga av skriptet.

source: A non-empty executable script /etc/ppp/ip-up.d/000usepeerdns has been detected. It must be modified, disabled or deleted. The best way to modify it is to upgrade the pppoeconf package to version 1.0 or later and to allow dpkg to install the new version of the script. The best way to disable it is to remove its execute permission. The best way to delete it is to purge the pppoeconf package.
de: Ein nicht-leeres, ausführbares Skript /etc/ppp/ip-up.d/000usepeerdns wurde erkannt. Es muß modifiziert, deaktiviert oder gelöscht werden. Der beste Weg es zu modifizieren, ist pppoeconf auf Version 1.0 oder Neuer zu aktualisieren und dpkg zu erlauben, die neue Version des Skriptes zu installieren. Der beste Weg es zu deaktivieren, ist es, das Aufführrecht zu entfernen. Der beste Weg es zu löschen, ist es, das pppoeconf-Paket komplett zu löschen.
es: Se ha detectado un programa ejecutable y no vacío «/etc/ppp/ip-up.d/000usepeerdns». Debe modificarse, deshabilitarse o borrarse.. La mejor forma de modificarlo es actualizar el paquete pppoeconf a la versión 1.0 o posterior y permitir que el programa sea sobrescrito por dpkg. La mejor forma de deshabilitarlo es eliminar el permiso de ejecución del programa. La mejor forma de borrarlo es purgar el paquete pppoeconf.
fr: Un script exécutable /etc/ppp/ip-up.d/000usepeerdns a été détecté. Il doit être modifié, désactivé ou enlevé. La meilleure façon de le modifier est de mettre à jour le paquet pppoeconf vers la version 1.0 ou supérieur et d'autoriser dpkg à installer la nouvelle version du script. La meilleure façon de le désactiver est d'enlever sa permission d'exécution. La meilleure façon d'enlever le script est de purger le paquet pppoeconf.
ja: 空でない実行可能なスクリプト /etc/ppp/ip-up.d/000usepeerdns が検出されました。これに対しては、修正する・無効にする、または削除を行う必要があります。修正を行うのに最も良い方法は、pppoeconf パッケージをバージョン 1.0 以降にアップグレードし、dpkg に新しいバージョンのスクリプトをインストールさせることです。無効にするのに最も良い方法は、実行権限を削除すること。そして、削除するのに最も良い方法は、pppoeconf パッケージを完全に削除 (purge) することです。
nl: Er is een niet-leeg, uitvoerbaar script /etc/ppp/ip-up.d/000usepeerdns aangetroffen. Het dient te worden aangepast, uitgezet of verwijderd. De beste manier om het aan te passen is door het pakket pppoeconf op te waarderen tot versie 1.0 of later en dpkg de nieuwste versies van dit script te laten installeren. De beste manier om het script uit te zetten is door zijn uitvoer-permissie te verwijderen. De beste manier om het script te verwijderen is het pppoeconf pakket te wissen (purge).
sv: Ett icke-blankt startbart skript, /etc/ppp/ip-up.d/000usepeerdns har identifierats. Det måste modifieras, stängas av eller tas bort. Det bästa sättet att modifiera det är att uppgradera paketet pppoeconf till version 1.0 eller senare och att tillåta dpkg att installera den nya versionen av skriptet. Det bästa sättet att stänga av det är att ta bort dess rättighet att starta. Det bästa sättet att ta bort det är att rensa ut paketet pppoeconf.

source: A rogue xisp PPP hook script is present
de: Ein vandalierendes xisp-PPP-Einhäng-Skript ist vorhanden
es: Se ha detectado un programa «anzuelo» PPP de xisp
fr: Script de configuration PPP de xisp erroné
ja: 問題になりそうな xisp の PPP フックスクリプトが存在しています。
nl: Een schadelijk PPP-haak-script van xisp is aanwezig.
sv: Ett påverkande PPP-kopplingsskript för xisp hittades

source: The xisp package contains scripts /etc/ppp/ip-up.d/0xisp-dns and /etc/ppp/ip-down.d/0xisp-dns (run by pppd after a PPP interface is brought up or down) that overwrite /etc/resolv.conf. The scripts must be modified, disabled or deleted so that they will not interfere with the operation of resolvconf. Contrary to Debian policy, merely removing the xisp package does not disable the scripts.
de: Das xisp-Paket enthält die Skripte /etc/ppp/ip-up.d/0xisp-dns und /etc/ppp/ip-down.d/0xisp-dns (welche vom pppd ausgeführt werden, nachdem die PPP-Schnittstelle hoch oder runtergefahren wurde) die /etc/resolv.conf überschreiben. Die Skripte müssen modifiziert, deaktiviert oder gelöscht werden, so daß sie nicht mit der Arbeit von resolvconf interferieren. Entgegen den Debian-Richtlinien reicht das Entfernen des Pakets nicht aus, um die Skripte zu deaktivieren.
es: El paquete xisp incluye los programas «/etc/ppp/ip-up.d/0xisp-up» y «/etc/ppp/ip-down.d/0xisp-down» (para que los ejecute pppd después de que una interfaz PPP se haya activado o desactivado) que sobreescriben el fichero «/etc/resolv.conf». Estos programas deben modificarse, deshabilitarse o borrarse para que no interfieran con el mecanismo de operación de resolvconf. Aunque es lo opuesto a lo que manda la normativa de Debian, no basta con borrar simplemente el paquete xisp para deshabilitar los programas.
fr: Le paquet xisp contient des scripts /etc/ppp/ip-up.d/0xisp-dns et /etc/ppp/ip-down.d/0xisp-dns (démarrés par pppd dès qu'une interface PPP est démarrée) qui réécrivent le fichier /etc/resolv.conf. Ces scripts doivent donc être modifiés, neutralisés ou enlevés afin qu'il n'y ait aucune interférence avec l'intervention de resolvconf. Contrairement à la charte Debian, une simple suppression du paquet xisp ne neutralise pas le script.
ja: xisp パッケージは、/etc/resolv.conf を上書きする /etc/ppp/ip-up.d/0xisp-dns および /etc/ppp/ip-down.d/0xisp-dns スクリプトを含んでいます (これらは PPP インターフェイスが起動・停止された後に pppd によって実行されます)。resolvconf の動作に干渉しないように、これらのスクリプトは修正・無効化、あるいは削除を行う必要があります。Debian ポリシーに反して、単純に xisp パッケージの削除ではスクリプトは無効にされません。
nl: Het pakket xisp bevat de scripts /etc/ppp/ip-up.d/0xisp-dns en /etc/ppp/ip-down.d/0xisp-dns (die worden uitgevoerd door pppd nadat een PPP-interface op of neer is gebracht) die /etc/resolv.conf overschrijven. Deze scripts moeten dus worden aangepast, uitgezet of verwijderd, zodat ze de werking van resolvconf niet verstoren. Ondanks dat Debian-beleid dit eist, zal het verwijderen (remove) van het pakket xisp deze scripts niet uitzetten.
sv: Paketet xisp innehåller skripten /etc/ppp/ip-up.d/0xisp-dns och /etc/ppp/ip-down.d/0xisp-dns (körs av pppd efter ett PPP-gränssnitt tas upp eller ner) som skriver över /etc/resolv.conf. Dessa skript måste modifieras, stängas av eller tas bort så att de inte påverkar resolvconf. Tvärtemot Debians policy räcker det inte att ta bort paketet xisp för att stänga av skripten.

source: A non-empty executable script /etc/ppp/ip-up.d/0xisp-dns and/or /etc/ppp/ip-down.d/0xisp-dns has been detected. Each one must be modified, disabled or deleted. The best way to disable it is to remove its execute permission. The best way to delete it is to purge the xisp package.
de: Ein nicht-leeres, ausführbares Skript /etc/ppp/ip-up.d/0xisp-dns und/oder /etc/ppp/ip-down.d/0xisp-dns wurde erkannt. Jedes davon muß modifiziert, deaktiviert oder gelöscht werden. Der beste Weg es zu deaktivieren, ist es, das Ausführrecht zu entfernen. Der beste Weg es zu löschen, ist es, das xisp-Paket komplett zu löschen.
es: Se ha detectado un programa ejecutable y no vacío «/etc/ppp/ip-up.d/0xisp-up» y/o «/etc/ppp/ip-down.d/0xisp-down». Cada programa debe modificarse, deshabilitarse o borrarse. La mejor forma de deshabilitarlos es quitar los permisos de ejecución al programa. La mejor forma de borrarlos es purgar el paquete xisp.
fr: Un script exécutable /etc/ppp/ip-up.d/0xisp-dns ou /etc/ppp/ip-down.d/0xisp-dns a été détecté. Il doit être modifié, désactivé ou enlevé. La meilleure façon de le désactiver est d'enlever sa permission d'exécution. La meilleure façon de le effacer est de purger le paquet xisp.
ja: 空でない実行可能なスクリプト /etc/ppp/ip-up.d/0xisp-dns および /etc/ppp/ip-down.d/0xisp-dns が検出されました。それぞれ、修正する・無効にする、あるいは削除を行う必要があります。無効にするのに最も良い方法は、実行権限を削除すること。そして、削除するのに最も良い方法は、xisp パッケージを完全に削除 (purge) することです。
nl: Er is een niet-leeg, uitvoerbaar script /etc/ppp/ip-up.d/0xisp-dns en/of /etc/ppp/ip-down.d/0xisp-dns aangetroffen. Deze scripts dienen te worden aangepast, uitgezet of verwijderd. De beste manier om het script uit te zetten is door zijn uitvoer-permissie te verwijderen. De beste manier om het script te verwijderen is het xisp pakket te wissen (purge).
sv: Ett icke-blankt startbart skript, /etc/ppp/ip-up.d/0xisp-dns och/eller /etc/ppp/ip-down.d/0xisp-dns har identifierats. De måste modifieras, stängas av eller tas bort. Det bästa sättet att stänga av de är att ta bort dess rättighet att starta. Det bästa sättet att ta bort det är att rensa ut paketet xisp.

source: Disable rogue hook scripts?
de: Vandalierende Einhäng-Skripte deaktivieren?
es: ¿Deshabilitar los programas «anzuelo»?
fr: Faut-il désactiver les scripts erronés ?
ja: 問題になりそうなフックスクリプトを無効にしますか?
nl: Zet schadelijke haak-scripts uit?
sv: Stänga av påverkande kopplingsskript?

source: Certain packages contain hook scripts which, contrary to Debian policy, modify the resolver configuration file even when the packages that own them are removed. Packages known to contain such rogue hook scripts are: pppconfig (<< 2.2.0 and 2.3), pppoeconf (<< 1.0), totd (<< 1.4-4) and xisp. Although the resolvconf package is marked as conflicting with these packages so that they are removed before resolvconf is installed, their rogue hook scripts may remain behind.
de: Einige Pakete enthalten Einhäng-Skripte, die entgegen den Debian-Richtlinien die resolver-Konfigurationsdateien selbst dann verändern, wenn die Pakete, zu denen sie gehören, entfernt würden. Pakete, von denen solche vandalierende Einhäng-Skripte bekannt sind, sind: pppconfig (<< 2.2.0 und 2.3), pppoeconf (<< 1.0), totd (<< 1.4-4) und xisp. Obwohl das resolvconf-Paket als Konflikt zu diesen gekennzeichnet ist, so daß diese vor der Installation von resolvconf entfernt werden, können ihre vandalierende Einhäng-Skripte zurückbleiben.
es: Algunos paquetes contienen programas «anzuelo» que, en contra de la normativa de Debian, modifican la configuración del archivo de resolución aún cuando los propios paquetes se han eliminado. Los paquetes que se sabe que contienen este tipo de programas «anzuelo» son: pppconfig (<< 2.2.0 y 2.3), pppoeconf (<< 1.0), totd (<< 1.4-4) y xisp. Si bien el paquete de resolvconf entra en conflicto con estos paquetes de forma que se eliminarán antes de instalarle, es posible que sus programas «anzuelo» permanezcan en el sistema.
fr: Certains paquets contiennent des scripts contraires à la charte Debian. Ils modifient le fichier de configuration du résolveur même lorsque ces paquets ont été enlevés. Les paquets connus pour contenir de tels scripts sont : pppconfig (<< 2.2.0 et 2.3), ppoeconf (<< 1.0), totd (<< 1.4-4) et xisp. Bien que le paquet resolvconf soit marqué comme étant en conflit avec ces paquets, leurs scripts défectueux peuvent malgré tout rester présents.
ja: フックスクリプトを含んでいる一部のパッケージは、Debian ポリシーに反し、スクリプトを含むパッケージが削除される際にリゾルバ設定ファイルを変更します。そのような問題のあるスクリプトを含んでいるパッケージは pppconfig (<< 2.2.0 および 2.3)、pppoeconf (<< 1.0)、totd (<< 1.4-4)、そして xisp です。resolvconf パッケージはこれらのパッケージと衝突 (conflict) するように設定されているので、resolvconf がインストールされる前にこれらのパッケージは削除されますが、問題のスクリプトは残ったままかもしれません。
nl: Sommige pakketten bevatten haak-scripts die, in strijd met Debian-beleid, de resolver-configuratiebestanden wijzigen zelfs als de pakketten die ze hebben geïnstalleerd zijn verwijderd. Pakketten waarvan bekend zijn dat ze zulke scripts bevatten zijn: pppconfig (<< 2.2.0 en 2.3), pppoeconf (<< 1.0), totd (<< 1.4-4) en xisp. Ondanks het feit dat resolvconf aangeeft dat het strijdig is met deze pakketten, zodat ze worden verwijderd voordat resolvconf wordt geïnstalleerd, blijven de schadelijke haak-scripts soms achter.
sv: Vissa paket innehåller kopplingsskript som, tvärtemot Debians policy, modifierar konfigurationsfilen för uppslag även när paketen som äger dem är borttagna. Paket kända att innehålla sådana påverkande kopplingsskript är: pppconfig (<< 2.2.0 och 2.3), pppoeconf (<< 1.0), totd (<< 1.4-4) och xisp. Även om paketet resolvconf är markerat för att vara i konflikt med dessa paket så att de blir borttagna före resolvconf är installerat kan deras kopplingsskript fortfarande finnas kvar.

source: If you agree then the post-installation process will disable rogue hook scripts by removing their execute permissions.
de: Falls Sie dem zustimmen, wird der Post-Installationsprozess diese vandalierende Einhäng-Skripte durch entfernen ihrer Ausführrechte deaktivieren.
es: El proceso de postinstalación deshabilitará estos programas «anzuelo» quitando los permisos de ejecución si vd. está de acuerdo.
fr: Si vous êtes d'accord, le processus d'installation désactivera ces scripts.
ja: ここで「はい」と答えると、問題になりそうなフックスクリプトを post-install 時に実行権限を取り去ることで無効にします。
nl: Als u toestemt dan zal het post-installatieproces de schadelijke haak-scripts uitzetten door hun uitvoer-permissies te verwijderen.
sv: Om du godkänner kommer efterinstallationsprocessen att stänga av påverkande kopplingsskript genom att ta bort deras starträttigheter.

source: If you do not agree then you should disable the rogue scripts manually, otherwise resolvconf will not work properly.
de: Falls Sie nicht zustimmen, sollten Sie die vandalierende Skripte manuell deaktivieren da andernfalls resolvconf nicht korrekt funktionieren wird.
es: Si no está de acuerdo, debería deshabilitar manualmente estos programas. Si no lo hace resolvconf no podrá trabajar correctamente.
fr: Dans le cas contraire, vous devrez les désactiver vous-mêmes.
ja: 「いいえ」と答えた場合は、問題になりそうなスクリプトを手動で無効にする必要があります。さもなければ resolvconf は正しく動作しないでしょう。
nl: Als u niet toestemt dient u de schadelijke scripts handmatig te verwijderen, anders zal resolvconf niet goed werken.
sv: Om du inte godkänner bör du stänga av de påverkande skripten manuellt annars kommer inte resolvconf att fungera korrekt.

source: Prepare /etc/resolv.conf for dynamic updates?
de: /etc/resolv.conf für dynamische Aktualisierungen vorbereiten?
es: ¿Preparar «/etc/resolv.conf» para poder tener actualizaciones dinámicas?
fr: Préparer /etc/resolv.conf pour mise à jour ?
gl: ¿Preparar /etc/resolv.conf para actualizacións dinámicas?
ja: /etc/resolv.conf を動的更新するようにしますか?
nl: /etc/resolv.conf klaar maken voor automatische bijwerkingen?
sv: Förbered /etc/resolv.conf för dynamiska uppdateringar?
vi: Chuẩn bị tập tin «/etc/resolv.conf» để cập nhật động không?
