Repository: armcc/resolvconf
Catalog: debian/po/*.po
Languages: de, es, fr, gl, ja, nl, sv, vi

source: After you have modified /etc/network/interfaces to add the required "dns-nameservers" lines you should point the /etc/resolvconf/resolv.conf.d/tail symbolic link to /dev/null.
de: Nachdem Sie /etc/network/interfaces geändert haben um die benötigte "dns-nameservers"-Zeile einzufügen sollten Sie den symbolischen Link von /etc/resolvconf/resolv.conf.d/tail auf /dev/null zeigen lassen.
es: Debería hacer apuntar el enlace simbólico «/etc/resolvconf/resolv.conf.d/tail» a «/dev/null» una vez haya modificado «/etc/network/interfaces» y añadido las líneas «dns-nameservers» que sean necesarias.
fr: Après avoir modifié /etc/network/interfaces pour ajouter les lignes « dns-nameservers », vous devriez faire pointer le lien symbolique /etc/resolvconf/resolv.conf.d/tail vers /dev/null.
gl: Despois de modificar /etc/network/interfaces para engadir as liñas "dns-nameservers" necesarias debería facer apuntar a ligazón simbólica /etc/resolvconf/resolv.conf.d/tail a /dev/null.
ja: /etc/network/interfaces に必要な "dns-nameservers" 行を加えた後、シンボリックリンク /etc/resolvconf/resolv.conf.d/tail が /dev/null を指すようにする必要があります。
nl: Nadat u /etc/network/interfaces heeft bewerkt om de benodigde "dns-nameservers"-regels toe te voegen dient u de symbolische koppeling /etc/resolvconf/resolv.conf.d/tail naar /dev/null te laten wijzen.
sv: Efter du har modifierat /etc/network/interfaces och lagt till raderna för "dns-nameservers" som krävs bör du peka en symbolisk länk från /etc/resolvconf/resolv.conf.d/tail till /dev/null.
vi: Sau khi bạn đã sửa đổi «/etc/network/interfaces» để thêm những dòng «dns-nameservers» cần thiết, bạn nên chỉ liên kết tượng trưng «/etc/resolvconf/resolv.conf.d/tail» tới «/dev/null».
